# Revision of loc

In [1]:
import numpy as np
import pandas as pd

In [11]:
np.random.seed(seed=0)
df = pd.DataFrame(np.random.randint(800, 1600,(4, 5)),
                  index = ["Trousers", "Blouses", "Accessories", 
                           "Hair products"],
                  columns = ["Product ID", "Quantity", "Popularity score", 
                             "Items sold", "Customer reviews"] )
df

,Product ID,Quantity,Popularity score,Items sold,Customer reviews
Trousers,1484,1359,1429,992,1563
Blouses,1507,1159,809,1523,1077
Accessories,1554,1399,870,1272,1400
Hair products,1196,1114,1505,1286,1351

In [12]:
df.loc["Blouses", "Items sold"]

np.int32(1523)

In [24]:
df[["Quantity", "Items sold"]]

               Quantity  Items sold
Trousers           1359         992
Blouses            1159        1523
Accessories        1399        1272
Hair products      1114        1286

In [21]:
df ["Quantity"]

Trousers         1359
Blouses          1159
Accessories      1399
Hair products    1114
Name: Quantity, dtype: int32

In [20]:
df ["Potential"] = df ["Quantity"] * df["Popularity score"]
df

,Product ID,Quantity,Popularity score,Items sold,Customer reviews,Potential
Trousers,1484,1359,1429,992,1563,1942011
Blouses,1507,1159,809,1523,1077,937631
Accessories,1554,1399,870,1272,1400,1217130
Hair products,1196,1114,1505,1286,1351,1676570

In [35]:
df = df.drop("Potential", axis=1)

In [36]:
df

,Product ID,Quantity,Popularity score,Items sold,Customer reviews
Trousers,1484,1359,1429,992,1563
Blouses,1507,1159,809,1523,1077
Accessories,1554,1399,870,1272,1400
Hair products,1196,1114,1505,1286,1351

In [37]:
df.loc[["Trousers", "Accessories"]]

,Product ID,Quantity,Popularity score,Items sold,Customer reviews
Trousers,1484,1359,1429,992,1563
Accessories,1554,1399,870,1272,1400

In [38]:
df

,Product ID,Quantity,Popularity score,Items sold,Customer reviews
Trousers,1484,1359,1429,992,1563
Blouses,1507,1159,809,1523,1077
Accessories,1554,1399,870,1272,1400
Hair products,1196,1114,1505,1286,1351

In [41]:
df.loc[["Blouses", "Hair products"], ["Popularity score", "Items sold"]]

               Popularity score  Items sold
Blouses                     809        1523
Hair products              1505        1286

## loc, iloc, and .query()

In [1]:
import numpy as np
import pandas as pd

In [8]:
np.random.seed(seed=1)
df = pd.DataFrame(np.random.randn(4, 5),
                  index = ["A", "B", "C", "D"],
                  columns = ["Product ID", "Quantity", "Sales", "Profit", 
                             "Margin"]
)
df

   Product ID  Quantity     Sales    Profit    Margin
A    1.624345 -0.611756 -0.528172 -1.072969  0.865408
B   -2.301539  1.744812 -0.761207  0.319039 -0.249370
C    1.462108 -2.060141 -0.322417 -0.384054  1.133769
D   -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [20]:
df.loc["C"]

Product ID    1.462108
Quantity     -2.060141
Sales        -0.322417
Profit       -0.384054
Margin        1.133769
Name: C, dtype: float64

In [10]:
df.loc[["C", "D"]]

   Product ID  Quantity     Sales    Profit    Margin
C    1.462108 -2.060141 -0.322417 -0.384054  1.133769
D   -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [19]:
df.loc [["A", "D"], ["Profit", "Margin"]]

     Profit    Margin
A -1.072969  0.865408
D  0.042214  0.582815

In [7]:
df

NameError: name 'df' is not defined

In [30]:
new_list = pd.DataFrame(df.loc["A":"C"], ["Product ID"])
new_list

            Product ID  Quantity  Sales  Profit  Margin
Product ID         NaN       NaN    NaN     NaN     NaN

In [34]:
df.loc["A":"C", ["Sales", "Margin"]]

pandas.core.frame.DataFrame

In [35]:
df

   Product ID  Quantity     Sales    Profit    Margin
A    1.624345 -0.611756 -0.528172 -1.072969  0.865408
B   -2.301539  1.744812 -0.761207  0.319039 -0.249370
C    1.462108 -2.060141 -0.322417 -0.384054  1.133769
D   -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [59]:
df.iloc[-2:, :3]

   Product ID  Quantity     Sales
C    1.462108 -2.060141 -0.322417
D   -1.099891 -0.172428 -0.877858

In [10]:
df

   Product ID  Quantity     Sales    Profit    Margin
A    1.624345 -0.611756 -0.528172 -1.072969  0.865408
B   -2.301539  1.744812 -0.761207  0.319039 -0.249370
C    1.462108 -2.060141 -0.322417 -0.384054  1.133769
D   -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [17]:
df.iloc[1:2, [2, 3]]

      Sales    Profit
B -0.761207  0.319039

In [9]:
df.iloc[1, 1:3]

Quantity    1.744812
Sales      -0.761207
Name: B, dtype: float64

## Query

In [2]:
import numpy as np
import pandas as pd

In [18]:
np.random.seed(seed=1)
df = pd.DataFrame(np.random.randn(4, 4),
                  index= ["A", "a", "B", "b"],
                  columns= ["Col1", "Col2", "Col3", "Col4"]

)
df

       Col1      Col2      Col3      Col4
A  1.624345 -0.611756 -0.528172 -1.072969
a  0.865408 -2.301539  1.744812 -0.761207
B  0.319039 -0.249370  1.462108 -2.060141
b -0.322417 -0.384054  1.133769 -1.099891

In [36]:
df.query("Col1 > 1 and Col4 < 0")

       Col1      Col2      Col3      Col4
A  1.624345 -0.611756 -0.528172 -1.072969